# Задание 1
# Пользователь вводит число. Определить, является ли оно четным.
##############################################################################################
# try:
#     number = int(input("Enter integer: "))
#     if number % 2 == 0:
#         print("The number is even.")
#     else:
#         print("Odd number.")
# except ValueError as error:
#     print("Enter only integer!")
##############################################################################################
# Задание 2
# Пользователь вводит два числа. Вывести на экран меньшее из этих чисел.
##############################################################################################
# try:
#     num1 = int(input("Enter first number: "))
#     num2 = int(input("Enter second number: "))
#     if num1 <= num2:
#         print(f"The smallest number is {num1}.")
#     else:
#         print(f"The smallest number is {num2}.")
# except ValueError as error:
#     print("Enter only integer!")
##############################################################################################
# Задание 3
# Пользователь вводит число. Определить, положительное это число, отрицательное или равно нулю.
#
# Задание 4
# Пользователь с клавиатуры вводит 5 оценок студента.
# Определить, допущен ли студент к экзамену.
# Студент получает допуск, если его средний балл 4 балла и выше.
#
# Задание 5
# Пользователь вводит с клавиатуры число.
# Если оно четное, умножить его на три, иначе – поделить на два.
# Результат вывести на экран.
#
# Задание 6
# Написать программу-калькулятор.
# Пользователь вводит два числа и выбирает арифметическое действие.
# Вывести на экран результат.