# Задание 1
# Пользователь вводит число. Определить, является ли оно четным.
#
# Задание 2
# Пользователь вводит два числа. Вывести на экран меньшее из этих чисел.
#
# Задание 3
# Пользователь вводит число. Определить, положительное это число, отрицательное или равно нулю.
#
# Задание 4
# Пользователь с клавиатуры вводит 5 оценок студента.
# Определить, допущен ли студент к экзамену.
# Студент получает допуск, если его средний балл 4 балла и выше.
#
# Задание 5
# Пользователь вводит с клавиатуры число.
# Если оно четное, умножить его на три, иначе – поделить на два.
# Результат вывести на экран.
#
# Задание 6
# Написать программу-калькулятор.
# Пользователь вводит два числа и выбирает арифметическое действие.
# Вывести на экран результат.